Repository: nikitafedorov008/itmo-pm-demo-app
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Agricultural Management System
ru: Система управления сельским хозяйством

source: Welcome to AgroMax
ru: Добро пожаловать в AgroMax

source: Username
ru: Имя пользователя

# enterUsername
source: Enter your username
ru: Введите имя пользователя

source: Password
ru: Пароль

# enterPassword
source: Enter your password
ru: Введите пароль

# login
source: Sign In
ru: Войти

source: Demo login
ru: Демо вход

# demoCredentials
source: demo / demo
ru: демо / демо

# invalidCredentials
source: Invalid username or password
ru: Неверное имя пользователя или пароль

source: Loading...
ru: Загрузка...

source: Field Status
ru: Состояние поля

source: Quick Access
ru: Быстрый доступ

source: Recent Activities
ru: Недавние действия

source: Agricultural Tools
ru: Сельскохозяйственные инструменты

source: Soil Analysis
ru: Анализ почвы

# analyzeSoilComposition
source: Analyze soil composition and nutrients
ru: Анализ состава почвы и питательных веществ

source: Pest & Disease
ru: Вредители и болезни

# detectManageCropPests
source: Detect and manage crop pests
ru: Обнаружение и борьба с вредителями культур

source: Crop Rotation
ru: Севооборот

source: Plan sustainable crop rotation
ru: Планирование устойчивого севооборота

source: Fertilizer Calculator
ru: Калькулятор удобрений

source: Calculate optimal fertilizer amounts
ru: Расчет оптимального количества удобрений

source: Irrigation Scheduler
ru: Планировщик орошения

# planManageIrrigationSchedules
source: Plan and manage irrigation schedules
ru: Планирование и управление графиками орошения

source: Field Details
ru: Детали поля

# fieldDetailsSubtitle
source: View and manage field information
ru: Просмотр и управление информацией о поле

source: Growth
ru: Рост

source: Analyze growth patterns
ru: Анализ паттернов роста

source: Experiments
ru: Эксперименты

source: Manage field experiments
ru: Управление полевыми экспериментами

source: Weekly Insights
ru: Еженедельные обзоры

source: View weekly agricultural insights
ru: Просмотр еженедельных сельскохозяйственных обзоров

source: Notifications
ru: Уведомления

source: Field Report Updated
ru: Отчет о поле обновлен

# updatedNDVIAnalysis
source: Updated NDVI analysis for Field #3
ru: Обновленный анализ NDVI для поля #3

source: Weather Alert
ru: Предупреждение о погоде

# heavyRainExpected
source: Heavy rain expected tomorrow
ru: Ожидается сильный дождь завтра

source: Logout
ru: Выйти

source: Settings
ru: Настройки

source: Search
ru: Поиск

source: Home
ru: Главная

source: Weather
ru: Погода

source: Plant
ru: Растение

source: Tools
ru: Инструменты

source: Field
ru: Поле

source: High
ru: Высокий

source: Medium
ru: Средний

source: Low
ru: Низкий

source: Back
ru: Назад

source: Close
ru: Закрыть

source: Add
ru: Добавить

source: Cancel
ru: Отмена

source: Save
ru: Сохранить

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: View
ru: Просмотр

source: Map
ru: Карта

source: Details
ru: Детали

source: Analysis
ru: Анализ

source: Add Note
ru: Добавить заметку

source: Category
ru: Категория

source: Status
ru: Статус

source: Rating
ru: Оценка

source: Note
ru: Заметка

source: Select category
ru: Выбрать категорию

source: Select status
ru: Выбрать статус

source: Disease
ru: Болезнь

source: Pest
ru: Вредитель

source: Fertilization
ru: Удобрение

source: Irrigation
ru: Орошение

source: Harvest
ru: Сбор урожая

# weatherLabel
source: Weather
ru: Погода

source: Other
ru: Другое

source: Pending
ru: В ожидании

source: In Progress
ru: В процессе

source: Completed
ru: Завершено

source: Urgent
ru: Срочно

source: Inspection
ru: Осмотр

source: Camera
ru: Камера

source: Gallery
ru: Галерея

source: Analyze Image
ru: Анализ изображения

source: No photo added
ru: Фото не добавлено

source: Image error
ru: Ошибка изображения

source: Analyzing...
ru: Анализ...

# analysisCompleted
source: Analysis completed successfully
ru: Анализ успешно завершен

source: Analysis failed
ru: Анализ не удался

source: Growth Rate
ru: Темп роста

source: Avg. Height
ru: Средняя высота

source: Growth Stage
ru: Стадия роста

source: Days to Harvest
ru: Дней до сбора урожая

source: Growth Progress
ru: Прогресс роста

source: Growth Stages
ru: Стадии роста

source: Vegetative
ru: Вегетативный

source: Seeding
ru: Посев

source: Germination
ru: Прорастание

source: Flowering
ru: Цветение

# harvestReady
source: Harvest
ru: Сбор урожая

source: Recommendations
ru: Рекомендации

source: Field Experiments
ru: Полевые эксперименты

source: Experiment Summary
ru: Сводка экспериментов

source: Active
ru: Активные

# completedExperiments
source: Completed
ru: Завершенные

source: Failed
ru: Неудачные

source: Recent Experiments
ru: Недавние эксперименты

source: Create New Experiment
ru: Создать новый эксперимент

source: Insights from Experiments
ru: Выводы из экспериментов

# weeklyInsightsTitle
source: Weekly Insights
ru: Еженедельные обзоры

source: Key Insights
ru: Ключевые выводы

source: Weather Impact
ru: Влияние погоды

# growthRateLabel
source: Growth Rate
ru: Темп роста

source: Pest Alert
ru: Оповещение о вредителях

# irrigationLabel
source: Irrigation
ru: Орошение

source: Weekly Activities
ru: Еженедельные действия

source: Weather Forecast
ru: Прогноз погоды

# addNoteForZone
source: Add Note for Zone {zoneNumber}
ru: Добавить заметку для зоны {zoneNumber}

source: Field Information
ru: Информация о поле

source: Field ID
ru: ID поля

source: Location
ru: Местоположение

source: Area
ru: Площадь

source: Crop Type
ru: Тип культуры

source: Planting Date
ru: Дата посадки

# growthStageLabel
source: Growth Stage
ru: Стадия роста

# fieldStatusLabel
source: Field Status
ru: Статус поля

# recentActivitiesLabel
source: Recent Activities
ru: Недавние действия

source: Field Actions
ru: Действия с полем

# soilAnalysisAction
source: Soil Analysis
ru: Анализ почвы

source: NDVI Scan
ru: Сканирование NDVI

source: Pest Control
ru: Борьба с вредителями

# irrigationAction
source: Irrigation
ru: Орошение

source: Current
ru: Текущий

source: Pests Detected
ru: Обнаружены вредители

source: Diseases Detected
ru: Обнаружены болезни

source: No Issues Detected
ru: Проблемы не обнаружены

source: Pest Name
ru: Имя вредителя

source: Disease Name
ru: Имя болезни

source: Description
ru: Описание

source: Severity
ru: Серьезность

source: Treatment Recommendations
ru: Рекомендации по лечению

source: Prevention Tips
ru: Советы по профилактике

source: Apply Treatment
ru: Применить лечение

source: Monitor Closely
ru: Тщательно наблюдать

source: No Treatment Needed
ru: Лечение не требуется

source: Treatment Applied
ru: Лечение применено

# pestAlertTitle
source: Pest Alert
ru: Оповещение о вредителях

# diseaseAlertTitle
source: Disease Alert
ru: Оповещение о болезнях

# soilAnalysisTitle
source: Soil Analysis
ru: Анализ почвы

source: Results
ru: Результаты

source: Recommendation
ru: Рекомендация

# fertilizerCalculatorTitle
source: Fertilizer Calculator
ru: Калькулятор удобрений

source: Calculate Fertilizer Requirements
ru: Расчет потребности в удобрениях

# fieldArea
source: Field Area (hectares)
ru: Площадь поля (гектары)

source: Enter field area
ru: Введите площадь поля

# cropTypeLabel
source: Crop Type
ru: Тип культуры

source: Select crop type
ru: Выберите тип культуры

source: Fertilizer Type
ru: Тип удобрений

source: Select fertilizer type
ru: Выберите тип удобрений

# nutrientRequirements
source: Nutrient Requirements (kg/hectare)
ru: Потребность в питательных веществах (кг/гектар)

source: Calculate
ru: Рассчитать

source: Calculation Results
ru: Результаты расчета

source: Recommended Fertilizer Amount
ru: Рекомендуемое количество удобрений

# irrigationSchedulerTitle
source: Irrigation Scheduler
ru: Планировщик орошения

# planIrrigationSchedule
source: Plan Your Irrigation Schedule
ru: Планирование графика орошения

source: Soil Type
ru: Тип почвы

source: Enter soil type
ru: Введите тип почвы

source: Irrigation Method
ru: Метод орошения

source: Select irrigation method
ru: Выберите метод орошения

source: Drip
ru: Капельное

source: Sprinkler
ru: Дождевание

source: Furrow
ru: Фурровое

source: Flood
ru: Затопление

source: Select Planting Date
ru: Выберите дату посадки

source: Generate Schedule
ru: Сгенерировать график

source: Irrigation Requirements
ru: Требования к орошению

source: Total Water Needed
ru: Всего воды необходимо

source: Daily Avg.
ru: Среднее за день

source: Irrigation Schedule
ru: График орошения

source: Save Schedule
ru: Сохранить график

source: Days
ru: Дни

source: Amount
ru: Количество

source: Duration
ru: Продолжительность

source: Method
ru: Метод

# pendingStatus
source: Pending
ru: В ожидании

source: Irrigation Tips
ru: Советы по орошению

source: Early Morning Watering
ru: Полив ранним утром

# earlyMorningWateringDesc
source: Water early in the morning to reduce evaporation losses
ru: Поливайте рано утром, чтобы уменьшить потери на испарение

source: Soil Moisture Monitoring
ru: Контроль влажности почвы

# soilMoistureDesc
source: Use soil moisture sensors to optimize irrigation timing
ru: Используйте датчики влажности почвы для оптимизации времени орошения

source: Weather Adjustment
ru: Корректировка погоды

# weatherAdjustmentDesc
source: Adjust schedule based on weather conditions and rainfall
ru: Корректируйте график в зависимости от погодных условий и осадков

source: Water Conservation
ru: Сохранение воды

# waterConservationDesc
source: Implement water-saving techniques to reduce consumption
ru: Применяйте методы экономии воды для снижения расхода

source: Growth Analysis
ru: Анализ роста

source: Growth Summary
ru: Сводка роста

# growthChart
source: Growth Trend Chart
ru: График тенденции роста

source: Height over time
ru: Высота со временем

# fieldExperimentsTitle
source: Field Experiments
ru: Полевые эксперименты

# experimentsSummary
source: Experiment Summary
ru: Сводка экспериментов

# addNoteTitle
source: Add Note
ru: Добавить заметку

source: Note Content
ru: Содержание заметки

source: Select Photo
ru: Выбрать фото

source: Capture Photo
ru: Сделать фото

source: Take Photo
ru: Сделать фото

source: From Gallery
ru: Из галереи

# fieldDetailsTitle
source: Field Details
ru: Детали поля

source: Map Preview
ru: Предварительный просмотр карты

source: Field Data
ru: Данные поля

source: Status Summary
ru: Сводка статуса

source: Healthy
ru: Здоровый

source: Growth Status
ru: Статус роста

source: Moisture Level
ru: Уровень влажности

source: Moisture
ru: Влажность

# fieldActionsTitle
source: Field Actions
ru: Действия с полем

# soilAnalysisActionTitle
source: Soil Analysis
ru: Анализ почвы

# pestControlAction
source: Pest Control
ru: Борьба с вредителями

# irrigationActionTitle
source: Irrigation
ru: Орошение

source: Growth Monitoring
ru: Мониторинг роста

source: Pest Monitoring
ru: Мониторинг вредителей

source: Disease Monitoring
ru: Мониторинг болезней

source: Fertilizer Management
ru: Управление удобрениями

source: Harvest Planning
ru: Планирование уборки

source: Weather Monitoring
ru: Мониторинг погоды

source: Field Analytics
ru: Полевая аналитика

# analyticsForZone
source: Analytics for Zone {zoneNumber}
ru: Аналитика для зоны {zoneNumber}

source: Recent Analytics
ru: Недавняя аналитика

source: Field Condition
ru: Состояние поля

source: Plant health status
ru: Состояние здоровья растений

source: Yield
ru: Урожайность

source: Health
ru: Здоровье

# areaLabel
source: Area
ru: Площадь

source: Temperature
ru: Температура

source: Temp
ru: Темп

# moisturePercentage
source: Moisture %
ru: Влажность %

# growthCmPerDay
source: Growth cm/day
ru: Рост см/день

source: Good
ru: Хорошо

source: Fair
ru: Удовлетворительно

source: Poor
ru: Плохо

source: None
ru: Нет

source: Issues
ru: Проблемы

source: Pest activity
ru: Активность вредителей

source: Disease detected
ru: Обнаружена болезнь

source: Growth issues
ru: Проблемы с ростом

source: Nutrient deficiency
ru: Дефицит питательных веществ

source: Water stress
ru: Водный стресс

source: Optimal
ru: Оптимально

source: Suboptimal
ru: Неоптимально

source: Critical
ru: Критично

source: Minor
ru: Незначительно

source: Moderate
ru: Умеренно

source: Major
ru: Серьезно

source: Very High
ru: Очень высокий

source: Very Low
ru: Очень низкий

source: Excellent
ru: Отлично

source: Average
ru: Средне

source: Below Average
ru: Ниже среднего

source: Above Average
ru: Выше среднего

source: Outstanding
ru: Выдающийся

source: Satisfactory
ru: Удовлетворительно

source: Unsatisfactory
ru: Неудовлетворительно

source: Acceptable
ru: Приемлемо

source: Requires Attention
ru: Требует внимания

source: Needs Improvement
ru: Нуждается в улучшении

source: Satisfactory Condition
ru: Удовлетворительное состояние

source: Requires Treatment
ru: Требует лечения

source: Under Observation
ru: Под наблюдением

source: In Good Condition
ru: В хорошем состоянии

source: Requires Monitoring
ru: Требует наблюдения

source: Optimal Conditions
ru: Оптимальные условия

source: Suboptimal Conditions
ru: Неоптимальные условия

source: Critical Conditions
ru: Критические условия

source: Growing
ru: Растет

source: Maturing
ru: Созревает

source: Ready for Harvest
ru: Готов к уборке

source: Harvested
ru: Убран

source: Planned
ru: Запланировано

source: Scheduled
ru: Запланировано

source: In Process
ru: В процессе

source: Finished
ru: Завершено

source: Cancelled
ru: Отменено

source: Postponed
ru: Отложено

source: Delayed
ru: Задержка

source: On Schedule
ru: По графику

source: Ahead of Schedule
ru: Впереди графика

source: Behind Schedule
ru: Позади графика

source: Normal
ru: Нормально

source: Abnormal
ru: Аномально

source: Stable
ru: Стабильно

source: Unstable
ru: Нестабильно

source: Increasing
ru: Увеличивается

source: Decreasing
ru: Уменьшается

source: Fluctuating
ru: Колеблется

source: Improving
ru: Улучшается

source: Deteriorating
ru: Ухудшается

source: Maintaining
ru: Поддерживается

source: Optimal Moisture
ru: Оптимальная влажность

source: Dry
ru: Сухой

source: Wet
ru: Мокрый

source: Soggy
ru: Переувлажненный

source: Well Watered
ru: Хорошо политый

source: Under Watered
ru: Недополитый

source: Over Watered
ru: Переполитый

source: Adequate
ru: Достаточный

source: Inadequate
ru: Недостаточный

source: Sufficient
ru: Достаточно

source: Insufficient
ru: Недостаточно

source: Plentiful
ru: Обильный

source: Sparse
ru: Редкий

source: Abundant
ru: Обильный

source: Deficient
ru: Недостаточный

source: Rich
ru: Богатый

source: Poor Soil
ru: Бедная почва

source: Fertile
ru: Плодородный

source: Infertile
ru: Неплодородный

source: Nutrient Rich
ru: Богатый питательными веществами

source: Nutrient Poor
ru: Бедный питательными веществами

source: Balanced
ru: Сбалансированный

source: Unbalanced
ru: Несбалансированный

source: Healthy Growth
ru: Здоровый рост

source: Stunted Growth
ru: Замедленный рост

source: Vigorous
ru: Бодрый

source: Weak
ru: Слабый

source: Strong
ru: Сильный

source: Fragile
ru: Хрупкий

source: Robust
ru: Прочный

source: Resilient
ru: Живучий

source: Vulnerable
ru: Уязвимый

source: Disease Resistant
ru: Устойчивый к болезням

source: Disease Susceptible
ru: Восприимчивый к болезням

source: Pest Resistant
ru: Устойчивый к вредителям

source: Pest Susceptible
ru: Восприимчивый к вредителям

source: Drought Tolerant
ru: Засухоустойчивый

source: Drought Sensitive
ru: Чувствительный к засухе

source: Cold Tolerant
ru: Морозоустойчивый

source: Cold Sensitive
ru: Чувствительный к холоду

source: Heat Tolerant
ru: Жароустойчивый

source: Heat Sensitive
ru: Чувствительный к жаре

source: Wind Resistant
ru: Устойчивый к ветру

source: Wind Sensitive
ru: Чувствительный к ветру

source: Sun Loving
ru: Светолюбивый

source: Shade Tolerant
ru: Теневыносливый

source: Frost Resistant
ru: Устойчивый к морозу

source: Frost Sensitive
ru: Чувствительный к морозу

source: Salt Tolerant
ru: Солеустойчивый

source: Salt Sensitive
ru: Чувствительный к соли

source: Alkaline Tolerant
ru: Щелочеустойчивый

source: Alkaline Sensitive
ru: Чувствительный к щелочи

source: Acid Loving
ru: Кислотолюбивый

source: Acid Sensitive
ru: Чувствительный к кислоте

source: Pest Free
ru: Свободный от вредителей

source: Disease Free
ru: Свободный от болезней

source: Pest Present
ru: Вредители присутствуют

source: Disease Present
ru: Болезни присутствуют

source: Minor Infestation
ru: Незначительное заражение

source: Moderate Infestation
ru: Умеренное заражение

source: Severe Infestation
ru: Сильное заражение

source: Minor Disease
ru: Незначительная болезнь

source: Moderate Disease
ru: Умеренная болезнь

source: Severe Disease
ru: Сильная болезнь

source: Early Stage
ru: Ранняя стадия

source: Mid Stage
ru: Средняя стадия

source: Late Stage
ru: Поздняя стадия

source: Initial Stage
ru: Начальная стадия

source: Advanced Stage
ru: Продвинутая стадия

source: End Stage
ru: Конечная стадия

source: Beginning
ru: Начало

source: Middle
ru: Середина

source: End
ru: Конец

source: Start
ru: Начать

source: Finish
ru: Закончить

source: Complete
ru: Завершить

source: Incomplete
ru: Незавершено

source: Ready
ru: Готов

source: Not Ready
ru: Не готов

source: Available
ru: Доступно

source: Unavailable
ru: Недоступно

source: Accessible
ru: Доступно

source: Inaccessible
ru: Недоступно

source: Usable
ru: Пригодно

source: Unusable
ru: Непригодно

source: Effective
ru: Эффективный

source: Ineffective
ru: Неэффективный

source: Efficient
ru: Эффективный

source: Inefficient
ru: Неэффективный

source: Productive
ru: Продуктивный

source: Unproductive
ru: Непродуктивный

source: Profitable
ru: Прибыльный

source: Unprofitable
ru: Неприбыльный

source: Sustainable
ru: Устойчивый

source: Unsustainable
ru: Неустойчивый

source: Environmentally Friendly
ru: Экологичный

source: Not Environmentally Friendly
ru: Неэкологичный

source: Cost Effective
ru: Экономически эффективный

source: Not Cost Effective
ru: Неэкономически эффективный

source: Time Efficient
ru: Времяэффективный

source: Not Time Efficient
ru: Невремяэффективный

source: Labor Efficient
ru: Трудоэффективный

source: Not Labor Efficient
ru: Нетрудоэффективный

source: Resource Efficient
ru: Ресурсоэффективный

source: Not Resource Efficient
ru: Нересурсоэффективный

source: Energy Efficient
ru: Энергоэффективный

source: Not Energy Efficient
ru: Неэнергоэффективный

source: Water Efficient
ru: Водоэффективный

source: Not Water Efficient
ru: Неводоэффективный

source: Fertilizer Efficient
ru: Удобрениеэффективный

source: Not Fertilizer Efficient
ru: Неудобрениеэффективный

source: Pesticide Efficient
ru: Пестицидеффективный

source: Not Pesticide Efficient
ru: Непестицидеффективный

source: Herbicide Efficient
ru: Гербицидеффективный

source: Not Herbicide Efficient
ru: Негербицидеффективный

source: Fungicide Efficient
ru: Фунгицидеффективный

source: Not Fungicide Efficient
ru: Нефунгицидеффективный

source: Bactericide Efficient
ru: Бактерицидеффективный

source: Not Bactericide Efficient
ru: Небактерицидеффективный

source: Nematicide Efficient
ru: Нематицидеффективный

source: Not Nematicide Efficient
ru: Ненематицидеффективный

source: Acaricide Efficient
ru: Акарицидеффективный

source: Not Acaricide Efficient
ru: Неакарицидеффективный

source: Rodenticide Efficient
ru: Родентицидеффективный

source: Not Rodenticide Efficient
ru: Неродентицидеффективный

source: Growth Regulator Efficient
ru: Регулятор роста эффективный

source: Not Growth Regulator Efficient
ru: Нерегулятор роста эффективный
